# HPerimN

## Description
Calculate a perimeter of an object. Same as HPerim(), but it gives more accurate result when the object is a polyline.

```pascal
FUNCTION HPerimN(ObjectHandle : HANDLE): REAL;
```

```python
def vs.HPerimN(ObjectHandle):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ObjectHandle|HANDLE|   |

## Examples
```pascal
perimeter := HPerimN(object);
```

## Version
Availability: from Vectorworks 2012

## Category
* Object Info